'use strict';

module.exports = {
  up: (queryInterface, Sequelize) => {
    return queryInterface.bulkInsert('Stations',
      [{ id: 8007, name: "пос. Николаевка" }, { id: 8008, name: "Загородная (по требованию)" }, { id: 8009, name: "Магазин (ул. Загородная)" },
      { id: 8010, name: "Песчаная" }, { id: 8011, name: "Карьер (ул. Загородная)" }, { id: 8012, name: "Поворот (ул. Загородная)" },
      { id: 8013, name: "проспект Мира (по требованию)" }, { id: 8014, name: "Завод Металлист" }, { id: 8015, name: "ЗСЖБ-5" }, { id: 8017, name: "Магазин (проспект Мира)" },
      { id: 8018, name: "Микрорайон Юбилейный" }, { id: 8019, name: "Радиостанция" }, { id: 8020, name: "Социальный рынок (проспект Мира)" },
      { id: 8021, name: "ДОК (проспект Мира)" }, { id: 8022, name: "Магазин Садко" }, { id: 8023, name: "ОмГУ" }, { id: 8024, name: "Нефтезаводская" },
      { id: 7521, name: "ДК им. Малунцева" }, { id: 7606, name: "КДЦ Кристалл" }, { id: 7607, name: "Технический университет" }, { id: 8755, name: "Медицинская академия" },
      { id: 7608, name: "СибАДИ" }, { id: 7739, name: "Арена-Омск (ул. Лукашевича)" }, { id: 8025, name: "Заречная" }, { id: 8026, name: "бульвар Зелёный" },
      { id: 8027, name: "Автовокзал (ул. Лукашевича)" }, { id: 7704, name: "Левобережный рынок (проспект Комарова)" }, { id: 7744, name: "Больница (ул. Степанца)" },
      { id: 7745, name: "5-й микрорайон" }, { id: 7639, name: "Поворотная (ул. 70 лет Октября)" }, { id: 9049, name: "Магазин (ул. 70 лет Октября)" },
      { id: 8028, name: "Дмитриева" }, { id: 8029, name: "проспект Комарова (ул. Дмитриева)" }, { id: 8030, name: "12-й микрорайон" }, { id: 8988, name: "1-я Садовая" },
      { id: 8031, name: "1-я Садовая" }, { id: 8032, name: "Школа" }, { id: 8033, name: "Конева" }, { id: 8034, name: "11-й микрорайон" }, { id: 7640, name: "ТЦ Континент" },
      { id: 7641, name: "Торговый город" }, { id: 7408, name: "Таксопарк" }, { id: 7749, name: "Аэропорт местных линий" }, { id: 7750, name: "Авиационная" },
      { id: 7751, name: "Поликлиника (ул. 12 Декабря)" }, { id: 7752, name: "Володарского" }, { id: 7753, name: "Военкомат (ул. Димитрова)" },
      { id: 7754, name: "Техникум (ул. Граничная)" }, { id: 7755, name: "22 Декабря" }, { id: 7756, name: "По требованию (ул. Олега Кошевого)" },
      { id: 7757, name: "Школа №55" }, { id: 7803, name: "Школа №53" }, { id: 8184, name: "Сады Яблонька" }, { id: 7804, name: "Нефтебаза (ул. Мельничная)" },
      { id: 7805, name: "Самарка" }, { id: 7806, name: "Магазин (ул. Мельничная)" }, { id: 8185, name: "Межрайбаза (ул. Мельничная)" },
      { id: 8194, name: "База ОПС" }, { id: 8195, name: "Механический завод" }, { id: 8196, name: "пос. Мелиораторов" },

      { id: 9110, name: "пос. Мелиораторов" }, { id: 8197, name: "Механический завод" }, { id: 8198, name: "База ОПС" },
      { id: 8199, name: "Межрайбаза (ул. Мельничная)" }, { id: 7799, name: "Магазин (ул. Мельничная)" }, { id: 7800, name: "Самарка" },
      { id: 7801, name: "Нефтебаза (ул. Мельничная)" }, { id: 8087, name: "Сады Яблонька" }, { id: 7802, name: "Школа №53" },
      { id: 7780, name: "Администрация Кировского округа" }, { id: 7781, name: "АО Сибирский хлеб" }, { id: 7782, name: "По требованию (ул. Олега Кошевого)" },
      { id: 7783, name: "22 Декабря" }, { id: 7784, name: "Техникум (ул. Граничная)" }, { id: 7785, name: "Военкомат (ул. Димитрова)" },
      { id: 7786, name: "Володарского" }, { id: 7787, name: "Поликлиника (ул. 12 Декабря)" }, { id: 7788, name: "Авиационная" },
      { id: 7789, name: "Аэропорт местных линий" }, { id: 7425, name: "Таксопарк" }, { id: 8035, name: "Торговый город" }, { id: 7426, name: "Амбулатория" },
      { id: 7472, name: "Строймаркет Новосёл" }, { id: 7473, name: "11-й микрорайон" }, { id: 7474, name: "Социальный рынок" }, { id: 7475, name: "Конева" },
      { id: 7481, name: "Школа" }, { id: 7482, name: "1-я Садовая" }, { id: 7483, name: "12-й микрорайон" },
      { id: 7484, name: "проспект Комарова (ул. Дмитриева)" }, { id: 7665, name: "Дмитриева" }, { id: 7666, name: "Поворотная (ул. 70 лет Октября)" },
      { id: 7746, name: "5-й микрорайон" }, { id: 7747, name: "Больница (ул. Степанца)" }, { id: 7695, name: "Левобережный рынок (проспект Комарова)" },
      { id: 7696, name: "Автовокзал (проспект Комарова)" }, { id: 8036, name: "Автовокзал (ул. Лукашевича)" }, { id: 8037, name: "бульвар Зелёный" },
      { id: 8038, name: "Заречная" }, { id: 7727, name: "Арена-Омск (ул. Лукашевича)" },
      { id: 7597, name: "СибАДИ" }, { id: 8998, name: "Медицинская академия" }, { id: 7902, name: "Технический университет" }, { id: 8039, name: "КДЦ Кристалл" },
      { id: 7572, name: "ДК им. Малунцева" }, { id: 8040, name: "Нефтезаводская" }, { id: 8041, name: "ОмГУ" }, { id: 8042, name: "Магазин Садко" },
      { id: 8043, name: "ДОК (проспект Мира)" }, { id: 8044, name: "Социальный рынок (проспект Мира)" }, { id: 8045, name: "Радиостанция" },
      { id: 8046, name: "Микрорайон Юбилейный" }, { id: 8047, name: "Магазин (проспект Мира)" }, { id: 8049, name: "ЗСЖБ-5" }, { id: 8050, name: "Завод Металлист" },
      { id: 8051, name: "проспект Мира (по требованию)" }, { id: 8052, name: "Поворот (ул. Загородная)" }, { id: 8053, name: "Карьер (ул. Загородная)" },
      { id: 8054, name: "Песчаная" }, { id: 8055, name: "Магазин (ул. Загородная)" }, { id: 8056, name: "Загородная (по требованию)" }, { id: 8057, name: "пос. Николаевка" }

      ], {});
  },

  down: (queryInterface, Sequelize) => {
    return queryInterface.bulkDelete('Stations', null, {});
  }
};
