'use strict';

module.exports = {
  up: (queryInterface, Sequelize) => {

    return queryInterface.bulkInsert('Stations',
      [
        { id: 7863, name: "Имени В.Бархатовой" }, { id: 8101, name: "Бородина" }, { id: 8102, name: "Стрельникова(трамвайное кольцо)" },
        { id: 8103, name: "Стрельникова(трамвайное кольцо)" }, { id: 8104, name: "Бородина" }, { id: 8105, name: "Первомайский рынок" },
        { id: 7864, name: "Кинотеатр Первомайский" }, { id: 7865, name: "Заозёрная" }, { id: 8106, name: "проспект Королёва" },
        { id: 7527, name: "Учхоз" }, { id: 7528, name: "СибНИИСХоз" }, { id: 8470, name: "Агрохимцентр" }, { id: 8997, name: "Агрохимцентр" },
        { id: 8471, name: "Областная больница" }, { id: 8472, name: "Санаторий Омский" }, { id: 7612, name: "Старозагородная Роща" },
        { id: 7613, name: "Городок Водников" }, { id: 7614, name: "Сибзавод" }, { id: 7615, name: "Рабиновича(ул.Красный Путь)" },
        { id: 7489, name: "Библиотека им.Пушкина" }, { id: 7490, name: "КДЦ Маяковский" }, { id: 7491, name: "Главпочтамт" },
        { id: 7492, name: "Госпиталь" }, { id: 7493, name: "Дом Туриста" }, { id: 7412, name: "Театральная пл." }, { id: 7494, name: "Декабристов" },
        { id: 7616, name: "Городской музей" }, { id: 7617, name: "6 - я линия" }, { id: 7618, name: "9 - я линия" },
        { id: 7619, name: "16 - я линия(ул. 10 лет Октября)" }, { id: 7620, name: "20 - я линия(ул. 10 лет Октября)" },
        { id: 7621, name: "25 - я линия(ул. 10 лет Октября)" }, { id: 8109, name: "ПАТП - 1" }, { id: 8110, name: "Автосервис(ул. 10 лет Октября)" },
        { id: 8111, name: "Куйбышевская база" }, { id: 8112, name: "ОПОГАТ - 9" }, { id: 9111, name: "По требованию(Окружная дорога)" },
        { id: 8113, name: "пос.Чкаловский" }, { id: 7448, name: "Романенко" }, { id: 7449, name: "50 лет ВЛКСМ" },
        { id: 7450, name: "Поликлиника(ул. 50 лет ВЛКСМ)" }, { id: 7451, name: "75 Гвардейской Бригады" }, { id: 7452, name: "ПТУ - 43" },
        { id: 7453, name: "ПО Автоматика" }, { id: 7454, name: "Столовая(проспект Космический)" }, { id: 7455, name: "Кинотеатр Космос" },
        { id: 8114, name: "СПТУ - 21" }, { id: 8115, name: "Промышленная" }, { id: 7960, name: "пос.Кордный" },
        { id: 8987, name: "Поликлиника(ул. 5 - я Кордная)" }, { id: 8116, name: "40 лет Октября" }, { id: 8117, name: "6 - я Шинная" },
        { id: 7977, name: "6 - я Шинная" }, { id: 7978, name: "Сбербанк(ул. 3 - я Молодёжная)" }, { id: 7979, name: "3 - я Молодёжная" },
        { id: 7980, name: "Гаражи(ул. 3 - я Молодёжная)" }, { id: 7948, name: "МСЧ - 9" }, { id: 7964, name: "МСЧ - 9" },

        { id: 8001, name: "Гаражи(ул. 3 - я Молодёжная)" },
        { id: 8002, name: "3 - я Молодёжная" }, { id: 8003, name: "Сбербанк(ул. 3 - я Молодёжная)" },
        { id: 8088, name: "6 - я Шинная" }, { id: 8089, name: "40 лет Октября" }, { id: 7951, name: "Поликлиника(ул. 5 - я Кордная)" },
        { id: 7952, name: "пос.Кордный" }, { id: 8090, name: "Промышленная" }, { id: 8091, name: "СПТУ - 21" }, { id: 7503, name: "Кинотеатр Космос" },
        { id: 7504, name: "Столовая(проспект Космический)" }, { id: 7505, name: "ПО Автоматика" }, { id: 7506, name: "ПТУ - 43" },
        { id: 7507, name: "75 Гвардейской Бригады" }, { id: 7508, name: "Поликлиника(ул. 50 лет ВЛКСМ)" }, { id: 7509, name: "Магазин(ул. 50 лет ВЛКСМ)" },
        { id: 7510, name: "50 лет ВЛКСМ" }, { id: 7511, name: "Романенко" }, { id: 7447, name: "пос.Чкаловский" },
        { id: 9112, name: "По требованию(Окружная дорога)" }, { id: 8092, name: "ОПОГАТ - 9" }, { id: 8093, name: "Куйбышевская база" },
        { id: 8094, name: "Автосервис(ул. 10 лет Октября)" }, { id: 8095, name: "ПАТП - 1" }, { id: 7584, name: "РЕЛЕРО" },

        { id: 7585, name: "25 - я линия(ул. 10 лет Октября)" }, { id: 7586, name: "20 - я линия(ул. 10 лет Октября)" },
        { id: 7587, name: "16 - я линия(ул. 10 лет Октября)" }, { id: 7588, name: "9 - я линия" }, { id: 7589, name: "6 - я линия" },
        { id: 7464, name: "Городской музей" }, { id: 7465, name: "Декабристов" }, { id: 7420, name: "Театральная пл." }, { id: 7466, name: "Дом Туриста" },
        { id: 7467, name: "Госпиталь" }, { id: 7468, name: "Главпочтамт" }, { id: 7469, name: "КДЦ Маяковский" }, { id: 8984, name: "Библиотека им.Пушкина" },
        { id: 7590, name: "Рабиновича(ул.Красный Путь)" }, { id: 7591, name: "Сибзавод" }, { id: 7592, name: "Городок Водников" },
        { id: 7593, name: "Старозагородная Роща" }, { id: 8473, name: "Санаторий Омский" }, { id: 8474, name: "Областная больница" },
        { id: 8604, name: "Агрохимцентр" }, { id: 7565, name: "СибНИИСХоз" }, { id: 7566, name: "Учхоз" }, { id: 8098, name: "проспект Королёва" },
        { id: 7904, name: "Заозёрная" }, { id: 7905, name: "Кинотеатр Первомайский" },
        { id: 8099, name: "Первомайский рынок" }, { id: 8100, name: "Бородина" }, { id: 7843, name: "Имени В.Бархатовой" }

      ], {});
  },

  down: (queryInterface, Sequelize) => {
    return queryInterface.bulkDelete('Stations', null, {});
  }
};
//let arr =[]; document.querySelectorAll( '.styled-list.style1 li h4 ').forEach(item => arr.push(item.innerText)); console.log(arr)
//let ids = []; document.querySelectorAll( 'input[name=checkboxes] ').forEach(item => ids.push(item.id));
// arr.map((currentValue, index) => JSON.stringify({id: ids[index], name: currentValue}))