'use strict';

module.exports = {
  up: (queryInterface, Sequelize) => {

    return queryInterface.bulkInsert('Stations',
      [{ id: 7513, name: "Омский нефтеперерабатывающий завод" }, { id: 7514, name: "ПО Нефтехимавтоматика" }, { id: 7515, name: "Спецавтоматика" },
      { id: 7516, name: "ПАТП-7" }, { id: 7517, name: "пос. Ермак" }, { id: 7518, name: "пл. Лицкевича" }, { id: 7519, name: "Магистральная" },
      { id: 7520, name: "Малунцева" }, { id: 7697, name: "проспект Комарова (ул. Лукашевича)" }, { id: 7698, name: "Лукашевича" },
      { id: 7672, name: "Универсам (ул. Дианова)" }, { id: 7673, name: "Лесной проезд (ул. Дианова)" }, { id: 7674, name: "ОАЗИС" }, { id: 7675, name: "Дианова" },
      { id: 7676, name: "Звёздная" }, { id: 7677, name: "Комкова" }, { id: 7678, name: "Дорстрой (ул. 2-я Солнечная)" }, { id: 7679, name: "пос. Солнечный" },
      { id: 7625, name: "пос. Солнечный" }, { id: 7626, name: "Дорстрой (ул. 2-я Солнечная)" }, { id: 7627, name: "Комкова" }, { id: 7628, name: "Звёздная" },
      { id: 7629, name: "Дианова" }, { id: 7630, name: "ОАЗИС" }, { id: 7631, name: "Лесной проезд (ул. Дианова)" }, { id: 7632, name: "Универсам (ул. Дианова)" },
      { id: 7702, name: "Лукашевича" }, { id: 7703, name: "проспект Комарова (ул. Лукашевича)" }, { id: 7571, name: "КДЦ Кристалл" },
      { id: 7573, name: "Малунцева" }, { id: 7574, name: "Магистральная" }, { id: 7575, name: "пл. Лицкевича" },
      { id: 7576, name: "пос. Ермак" }, { id: 7852, name: "пос. Ермак" }, { id: 7577, name: "ПАТП-7" }, { id: 7578, name: "Спецавтоматика" },
      { id: 7579, name: "ПО Нефтехимавтоматика" }, { id: 7580, name: "Поликлиника (проспект Губкина)" }, { id: 7581, name: "Омский нефтеперерабатывающий завод" },



      ], {});
  },

  down: (queryInterface, Sequelize) => {
    return queryInterface.bulkDelete('Stations', null, {});
  }
};

