'use strict';

module.exports = {
  up: (queryInterface, Sequelize) => {
    return queryInterface.bulkInsert('Stations', [
      // {     
    //   id: 8007,
    //   name: 'пос. Николаевка'
    // },
    // {     
    //   id: 8008,
    //   name:  'Загородная (по требованию) '
    // },
    // {     
    //   id: 8009,
    //   name:  'Магазин (ул. Загородная) '
    // },
    // {     
    //   id: 8010,
    //   name:  'Песчаная '
    // },
    // {     
    //   id: 8011,
    //   name:  'Карьер (ул. Загородная) '
    // },
    // {     
    //   id: 8012,
    //   name:  'Поворот (ул. Загородная) '
    // },
    // {     
    //   id: 8013,
    //   name:  'проспект Мира (по требованию) '
    // },
    // {     
    //   id: 8014,
    //   name:  'Завод Металлист '
    // },
    // {     
    //   id: 8015,
    //   name:  'ЗСЖБ-5 '
    // },
    // {     
    //   id: 8017,
    //   name:  'Магазин (проспект Мира) '
    // },
    // {     
    //   id: 8018,
    //   name:  'Микрорайон Юбилейный '
    // },
    // {     
    //   id: 8019,
    //   name:  'Радиостанция '
    // },
    // {     
    //   id: 8020,
    //   name:  'Социальный рынок (проспект Мира) '
    // },
    // {     
    //   id: 8021,
    //   name:  'ДОК (проспект Мира) '
    // },
    // {     
    //   id: 8022,
    //   name:  'Магазин Садко '
    // },
    // {     
    //   id: 8023,
    //   name:  'ОмГУ '
    // },
    // {     
    //   id: 8024,
    //   name:  'Нефтезаводская '
    // },
    // {     
    //   id: 7521,
    //   name:  'ДК им. Малунцева '
    // },
    // {     
    //   id: 7606,
    //   name:  'КДЦ Кристалл '
    // },
    // {     
    //   id: 7607,
    //   name:  'Технический университет '
    // },
    // {     
    //   id: 8755,
    //   name:  'Медицинская академия '
    // },
    // {     
    //   id: 7608,
    //   name:  'СибАДИ '
    // },
    // {     
    //   id: 7739,
    //   name:  'Арена-Омск (ул. Лукашевича) '
    // },
    // {     
    //   id: 8025,
    //   name:  'Заречная '
    // },
    // {     
    //   id: 8026,
    //   name:  'бульвар Зелёный '
    // },
    // {     
    //   id: 8027,
    //   name:  'Автовокзал (ул. Лукашевича) '
    // },
    // {     
    //   id: 7704,
    //   name:  'Левобережный рынок (проспект Комарова) '
    // },
    // {     
    //   id: 7744,
    //   name:  'Больница (ул. Степанца) '
    // },
    // {     
    //   id: 7745,
    //   name:  '5-й микрорайон '
    // },
    // {     
    //   id: 7639,
    //   name:  'Поворотная (ул. 70 лет Октября) '
    // },
    // {     
    //   id: 9049,
    //   name:  'Магазин (ул. 70 лет Октября) '
    // },
    // {     
    //   id: 8028,
    //   name:  'Дмитриева '
    // },
    // {     
    //   id: 8029,
    //   name:  'проспект Комарова (ул. Дмитриева) '
    // },
    // {     
    //   id: 8030,
    //   name:  '12-й микрорайон '
    // },
    // {     
    //   id: 8988,
    //   name:  '1-я Садовая '
    // },
    // {     
    //   id: 8031,
    //   name:  '1-я Садовая '
    // },
    // {     
    //   id: 8032,
    //   name:  'Школа '
    // },
    // {     
    //   id: 8033,
    //   name:  'Конева '
    // },
    // {     
    //   id: 8034,
    //   name:  '11-й микрорайон '
    // },
    // {     
    //   id: 7640,
    //   name:  'ТЦ Континент '
    // },
    // {     
    //   id: 7641,
    //   name:  'Торговый город '
    // },
    // {     
    //   id: 7408,
    //   name:  'Таксопарк '
    // },
    // {     
    //   id: 7749,
    //   name:  'Аэропорт местных линий '
    // },
    // {     
    //   id: 7750,
    //   name:  'Авиационная '
    // },
    // {     
    //   id: 7751,
    //   name:  'Поликлиника (ул. 12 Декабря) '
    // },
    // {     
    //   id: 7752,
    //   name:  'Володарского '
    // },
    // {     
    //   id: 7753,
    //   name:  'Военкомат (ул. Димитрова) '
    // },
    // {     
    //   id: 7754,
    //   name:  'Техникум (ул. Граничная) '
    // },
    // {     
    //   id: 7755,
    //   name:  '22 Декабря '
    // },
    // {     
    //   id: 7756,
    //   name:  'По требованию (ул. Олега Кошевого) '
    // },
    // {     
    //   id: 7757,
    //   name:  'Школа №55 '
    // },
    // {     
    //   id: 7803,
    //   name:  'Школа №53 '
    // },
    {     
      id: 8184,
      name:  'Сады Яблонька '
    },
    {     
      id: 7804,
      name:  'Нефтебаза (ул. Мельничная) '
    },
    {     
      id: 7805,
      name:  'Самарка '
    },
    {     
      id: 7806,
      name:  'Магазин (ул. Мельничная) '
    },
    {     
      id: 8185,
      name:  'Межрайбаза (ул. Мельничная) '
    },
    {     
      id: 8194,
      name:  'База ОПС '
    },
    {     
      id: 8195,
      name: 'Механический завод '
    },
    {     
      id: 8196,
      name:  'пос. Мелиораторов '
    }
  ], {});
  },

  down: (queryInterface, Sequelize) => {
    return queryInterface.bulkDelete('Stations', null, {});
  }
};
